//
// Created by gnatk on 23.02.2022.
//
#include <iostream>
using namespace std;

int main() {
    //використання додаткової змінної
    int a = 14, b = 7;
    cout << " До використання додаткової змінної: " << a << " -> " << b << endl;
    int c;
    c = a;
    a = b;
    b = c;
    cout << "Використання додаткової змінної: " << a << " -> " << b << endl;
    //Використання операції додавання та віднімання
    int d, e, f, g;
    cout << "Перше число= ";
    cin >> d;
    cout << "Друге число= ";
    cin >> e;
    f = d + e;
    g = d - e;
    cout << "Сума= " << f << endl;
    cout << "Різниця= " << g << endl;
     //Використання операції множення та ділення
    int h, i, hi, ih;
    cout << "Перше число= ";
    cin >> h;
    cout << "Друге число= ";
    cin >> i;
    hi = h * i;
    ih = h/i;
    cout << "Добуток= " << hi << endl;
    cout << "Ділення= " << ih << endl;
    //Використання операції кон’юнкції та диз’юнкції
    int j, k;
    cout << "Введіть перше значення: " << endl;
    cin >> j;
    cout << "Введіть друге значення: " << endl;
    cin >> k;
    j = (j & ~k) | (~j & k);
    k = (j & ~k) | (~j & k);
    j = (j & ~k) | (~j & k);
    cout << "Перше значення= " << j << endl;
    cout << "Друге значення= " << k << endl;
    //Використання операції зсуву
    long int l;
    long int m;
    long int n;
    cout << "Перше значення= ";
    cin >> l;
    cout << "Друге значення= ";
    cin >> m;
    n  =(l << 16) | m;
    m =n >> 16;
    l =(n << 16) >> 16;
    cout << "Перше значення= " << l << endl;
    cout << "Друге значення= " << m << endl;
    //Використання операції додавання по модулю 2
    int o,p;
    cout << "Перше значення= ";
    cin >> o;
    cout << "Друге значення= ";
    cin >> p;
    o = o^p;
    p = p^o;
    o = o^p;
    cout << "Перше значення= " << o << endl;
    cout << "Друге значення= " << p << endl;

    return 0;
}

