// Засобами C++ написати код для зміни контенту двох змінних за допомогою підходів
//    Використовуючи додаткову змінну;
//    Використовуючи операції додавання та віднімання;
//    Використовуючи операції множення та ділення;
//    Використовуючи операції кон’юнкції та диз’юнкції;
//    Використовуючи операції зсуву;
//    Використовуючи операцію додавання по модулю 2.

#include <iostream>

using namespace std;

int main() {
    int a, b;
    // додаткова змінна
    a = 2, b = 3;
    int c = a;
    a = b;
    b = c;
    cout << "додаткова змінна: " << a << " " << b;
    // додавання та віднімання
    a = 2, b = 3;
    a = a + b;
    b = a - b;
    a = a - b;
    cout << "\nдодавання та віднімання: " << a << " " << b;
    // множення та ділення
    a = 2, b = 3;
    a = a * b;
    b = a / b;
    a = a / b;
    cout << "\nмноження та ділення: " << a << " " << b;
    // кон’юнкція та диз’юнкція
    a = 2, b = 3;
    a = (a & ~b) | (~a & b);
    b = (a & ~b) | (~a & b);
    a = (a & ~b) | (~a & b);
    cout << "\nкон’юнкція та диз’юнкція: " << a << " " << b;
    // зсув
    a = 2, b = 3;
    long long int d = a << 16 | b;
    d = static_cast<int>(d << 16 | d >> 16);
    a = static_cast<int>(d >> 16);
    b = static_cast<short>(d);
    cout << "\nзсув: " << a << " " << b;
    // додавання по модулю 2
    a = 2, b = 3;
    a = a ^ b;
    b = a ^ b;
    a = a ^ b;
    cout << "\nдодавання по модулю 2: " << a << " " << b;
    return 0;
}
