#include<iostream>
using namespace std;
int main()
{
	//1-Використовуючи додаткову змінну
    int a = 20;
    int b = 10;
   /* int temp = a;
    a = b;
    b = temp;
    cout << "a = " << a << ", b = " << b << endl;*/
    //Використовуючи операції додавання та віднімання; 
    //a = a + b;//30
    //b = a - b;//20
    //a = a - b;//10
    //cout << "a = " << a << ", b = " << b;
    //Використовуючи операції множення та ділення; 
    //a = a * b;//200
    //b = a / b;//20
    //a = a / b;//10
    //cout << "a = " << a << ", b = " << b;
    //Використовуючи операції кон’юнкції та диз’юнкції; 
    //?
    //Використовуючи операції зсуву;
     
    //Використовуючи операцію додавання по модулю 2. 
   /* a = a ^ b;
    b = a ^ b;
    a = a ^ b;
    cout << "a = " << a << ", b = " << b;*/
    



	system("pause>0");
	return 0;
}